Tekla Open API Reference for Tekla Structures 2025
Polymesh.CompareFingerprints Method
 Compares two fingerprints
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool CompareFingerprints(
	string fingerprint1,
	string fingerprint2
)
Public Shared Function CompareFingerprints (
	fingerprint1 As String,
	fingerprint2 As String
) As Boolean
Parameters
fingerprint1
Type: System.String
The input parameter
fingerprint2
Type: System.String
The input parameter2
Return Value
Type: Boolean
True if fingerprints match, false otherwise
See Also
Reference
Polymesh Class
Tekla.Structures.Model Namespace